In [31]:
from pydataset import data
import numpy as np
import pandas as pd
from env import host, user, password

ModuleNotFoundError: No module named 'env'

In [2]:
mpg = data('mpg')

In [3]:
mpg.head()

  manufacturer model  displ  year  cyl       trans drv  cty  hwy fl    class
1         audi    a4    1.8  1999    4    auto(l5)   f   18   29  p  compact
2         audi    a4    1.8  1999    4  manual(m5)   f   21   29  p  compact
3         audi    a4    2.0  2008    4  manual(m6)   f   20   31  p  compact
4         audi    a4    2.0  2008    4    auto(av)   f   21   30  p  compact
5         audi    a4    2.8  1999    6    auto(l5)   f   16   26  p  compact

### 1. Load the mpg dataset and anser the following:

- On average, which manufacturer has the best miles per gallon?
- How many different manufacturers are there?
- How many different models are there?
- Do automatic or manual cars have better miles per gallon?

In [4]:
mpg['avg_mpg_per_manufacturer'] = ((mpg.cty + mpg.hwy) / 2)
mpg.sort_values(by = 'avg_mpg_per_manufacturer', ascending=False)
# Volkswagon has the best mpg

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class,avg_mpg_per_manufacturer
222,volkswagen,new beetle,1.9,1999,4,manual(m5),f,35,44,d,subcompact,39.5
213,volkswagen,jetta,1.9,1999,4,manual(m5),f,33,44,d,compact,38.5
223,volkswagen,new beetle,1.9,1999,4,auto(l4),f,29,41,d,subcompact,35.0
197,toyota,corolla,1.8,2008,4,manual(m5),f,28,37,r,compact,32.5
196,toyota,corolla,1.8,1999,4,manual(m5),f,26,35,r,compact,30.5
...,...,...,...,...,...,...,...,...,...,...,...,...
127,jeep,grand cherokee 4wd,4.7,2008,8,auto(l5),4,9,12,e,suv,10.5
60,dodge,durango 4wd,4.7,2008,8,auto(l5),4,9,12,e,suv,10.5
66,dodge,ram 1500 pickup 4wd,4.7,2008,8,auto(l5),4,9,12,e,pickup,10.5
70,dodge,ram 1500 pickup 4wd,4.7,2008,8,manual(m6),4,9,12,e,pickup,10.5
55,dodge,dakota pickup 4wd,4.7,2008,8,auto(l5),4,9,12,e,pickup,10.5

In [5]:
# mpg['manufacturer'].unique().tolist() # make a list of the unique values of the manufacturer column
# len(mpg['manufacturer'].unique().tolist()) # count the total unique values
mpg.manufacturer.nunique() # this counts all the unique values

15

In [6]:
# This is the amount of unique models within the mpg DataFrame

# len(mpg['model'].unique().tolist())
mpg.model.nunique()

38

In [7]:
# agg for all types of cars

mpg.groupby('trans').avg_mpg_per_manufacturer.agg(['min', 'mean', 'max'])

             min       mean   max
trans
auto(av)    22.0  23.900000  27.0
auto(l3)    21.0  24.000000  27.0
auto(l4)    12.5  18.951807  35.0
auto(l5)    10.5  17.717949  30.5
auto(l6)    15.0  16.833333  19.5
auto(s4)    20.5  22.166667  23.5
auto(s5)    15.0  21.333333  26.5
auto(s6)    15.0  21.281250  25.5
manual(m5)  13.5  22.775862  39.5
manual(m6)  10.5  20.552632  27.5

### 2. Joining and Merging

> Copy the `users` and `roles` dataframes from the obove examples.

- What do you think the folling join(s) will look like:
    - `right`
    - `outer`

In [12]:
# copy users
users = pd.DataFrame({
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['bob', 'joe', 'sally', 'adam', 'jane', 'mike'],
    'role_id': [1, 2, 3, 3, np.nan, np.nan]
})
users

   id   name  role_id
0   1    bob      1.0
1   2    joe      2.0
2   3  sally      3.0
3   4   adam      3.0
4   5   jane      NaN
5   6   mike      NaN

In [13]:
# copy roles
roles = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['admin', 'author', 'reviewer', 'commenter']
})
roles

   id       name
0   1      admin
1   2     author
2   3   reviewer
3   4  commenter

In [16]:
# left join

pd.merge(users, roles, left_on = 'role_id',right_on = 'id', how = 'left')

   id_x name_x  role_id  id_y    name_y
0     1    bob      1.0   1.0     admin
1     2    joe      2.0   2.0    author
2     3  sally      3.0   3.0  reviewer
3     4   adam      3.0   3.0  reviewer
4     5   jane      NaN   NaN       NaN
5     6   mike      NaN   NaN       NaN

In [19]:
pd.merge(users, roles, left_on = 'role_id',right_on = 'id', how = 'right')

   id_x name_x  role_id  id_y     name_y
0   1.0    bob      1.0     1      admin
1   2.0    joe      2.0     2     author
2   3.0  sally      3.0     3   reviewer
3   4.0   adam      3.0     3   reviewer
4   NaN    NaN      NaN     4  commenter

- What happens if you drop the foreign keys from the dataframes and try to merge them?

In [24]:
users.drop(['role_id'], axis = 1)

   id   name
0   1    bob
1   2    joe
2   3  sally
3   4   adam
4   5   jane
5   6   mike

In [28]:
roles.drop(['id'], axis = 1)

        name
0      admin
1     author
2   reviewer
3  commenter

In [30]:
# since there is nothing these DataFrames have in common we will get an error
pd.merge(users, roles, left_on = 'id',right_on = 'name', how = 'left')

ValueError: You are trying to merge on int64 and object columns. If you wish to proceed you should use pd.concat

### 3. Getting `data` from `SQL` databases

   a. create a function names `get_db_url`

It should accept username, hostname, password, and database and return a url formatted like our

<div class="alert alert-block alert-info">
<b>Example:</b> mysql+pymysql://codeup:p@assw0rd@123.123.123.123/some_db
</div>

b. Use function to connect with the `employees` database

c. Run the following queries

- intentionally make a typo in the database url. What kind of error message do you see?

- Intentionally make an error in your SQL query. What does the error message look like?

d. Read the `employees` and `titles` tables into two separate dataframes

e. Visualize the number of employees with each title.

f. Join the `employees` and `titles` dataframes together

g. Visualize how frequently employees change titles.

h. For each title, find the hire date of the employee that was hired most recently with that title

i. Write the code necessary to create a cross tabulation of the number of titles by department. 

<div class="alert alert-block alert-info">
<b>Hint:</b> this will involve a combination of SQL and python/pandas code
</div>

### 4. Use your `get_db_url` function to help you explore the data from the `chipotle` database. Use the data to answer the following questions:

- What is the total price for each order?

- What are the most popular 3 items?

- Which item has produced the most revenue?